mlyszczek/nuttx/arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_rom.c
/************************************************************************************
 * arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_rom.c
 *
 *   Copyright (C) 2019 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * This is a port of TI's setup_rom.c file which has a fully compatible BSD license:
 *
 *    Copyright (c) 2015-2017, Texas Instruments Incorporated
 *    All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

/************************************************************************************
 * Included Files
 ************************************************************************************/

/* Hardware headers */

#include "../inc/hw_types.h"
#include "../inc/hw_memmap.h"
#include "../inc/hw_adi.h"
#include "../inc/hw_adi_2_refsys.h"
#include "../inc/hw_adi_3_refsys.h"
#include "../inc/hw_adi_4_aux.h"
#include "../inc/hw_aon_batmon.h"
#include "../inc/hw_aux_sysif.h"
#include "../inc/hw_ccfg.h"
#include "../inc/hw_ddi_0_osc.h"
#include "../inc/hw_fcfg1.h"

/* Driverlib headers */

#include "ddi.h"
#include "ioc.h"
#include "osc.h"
#include "sys_ctrl.h"
#include "setup_rom.h"

/************************************************************************************
 * Public Functions
 ************************************************************************************/

/******************************************************************************
 *
 * rom_setup_stepvaddrtrimto
 *
 ******************************************************************************
 */

void rom_setup_stepvaddrtrimto(uint32_t toCode)
{
  uint32_t pmctlResetctl_reg;
  int32_t targetTrim;
  int32_t currentTrim;

  targetTrim =
    SetupSignExtendVddrTrimValue(toCode &
                                 (ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_M >>
                                  ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_S));
  currentTrim =
    SetupSignExtendVddrTrimValue((HWREGB(ADI3_BASE + ADI_3_REFSYS_O_DCDCCTL0) &
                                  ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_M) >>
                                 ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_S);

  if (targetTrim != currentTrim)
    {
      pmctlResetctl_reg =
        (HWREG(AON_PMCTL_BASE + AON_PMCTL_O_RESETCTL) &
         ~AON_PMCTL_RESETCTL_MCU_WARM_RESET_M);
      if (pmctlResetctl_reg & AON_PMCTL_RESETCTL_VDDR_LOSS_EN_M)
        {
          HWREG(AON_PMCTL_BASE + AON_PMCTL_O_RESETCTL) =
            (pmctlResetctl_reg & ~AON_PMCTL_RESETCTL_VDDR_LOSS_EN_M);
          HWREG(AON_RTC_BASE + AON_RTC_O_SYNC); /* Wait for VDDR_LOSS_EN
                                                 * setting to propagate */

        }

      while (targetTrim != currentTrim)
        {
          HWREG(AON_RTC_BASE + AON_RTC_O_SYNCLF);       /* Wait for next edge
                                                         * on SCLK_LF (positive 
                                                         * or negative) */

          if (targetTrim > currentTrim)
            currentTrim++;
          else
            currentTrim--;

          HWREGB(ADI3_BASE + ADI_3_REFSYS_O_DCDCCTL0) = ((HWREGB
                                                          (ADI3_BASE +
                                                           ADI_3_REFSYS_O_DCDCCTL0)
                                                          &
                                                          ~ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_M)
                                                         |
                                                         ((((uint32_t)
                                                            currentTrim) <<
                                                           ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_S)
                                                          &
                                                          ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_M));
        }

      HWREG(AON_RTC_BASE + AON_RTC_O_SYNCLF);   /* Wait for next edge on
                                                 * SCLK_LF (positive or
                                                 * negative) */

      if (pmctlResetctl_reg & AON_PMCTL_RESETCTL_VDDR_LOSS_EN_M)
        {
          HWREG(AON_RTC_BASE + AON_RTC_O_SYNCLF);       /* Wait for next edge
                                                         * on SCLK_LF (positive 
                                                         * or negative) */

          HWREG(AON_RTC_BASE + AON_RTC_O_SYNCLF);       /* Wait for next edge
                                                         * on SCLK_LF (positive 
                                                         * or negative) */

          HWREG(AON_PMCTL_BASE + AON_PMCTL_O_RESETCTL) = pmctlResetctl_reg;
          HWREG(AON_RTC_BASE + AON_RTC_O_SYNC); /* And finally wait for
                                                 * VDDR_LOSS_EN setting to
                                                 * propagate */

