mlyszczek/nuttx/arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_rom.c
        }
    }
}

/******************************************************************************
 *
 * rom_setup_coldreset_from_shutdown_cfg1
 *
 ******************************************************************************
 */

void rom_setup_coldreset_from_shutdown_cfg1(uint32_t ccfg_ModeConfReg)
{
  /* Check for CC1352 boost mode The combination VDDR_EXT_LOAD=0 and
   * VDDS_BOD_LEVEL=1 is defined to select boost mode */

  if (((ccfg_ModeConfReg & CCFG_MODE_CONF_VDDR_EXT_LOAD) == 0) &&
      ((ccfg_ModeConfReg & CCFG_MODE_CONF_VDDS_BOD_LEVEL) != 0))
    {
      /* Set VDDS_BOD trim - using masked write {MASK8:DATA8} - TRIM_VDDS_BOD
       * is bits[7:3] of ADI3..REFSYSCTL1 - Needs a positive transition on
       * BOD_BG_TRIM_EN (bit[7] of REFSYSCTL3) to latch new VDDS BOD. Set to 0
       * first to guarantee a positive transition. */

      HWREGB(ADI3_BASE + ADI_O_CLR + ADI_3_REFSYS_O_REFSYSCTL3) =
        ADI_3_REFSYS_REFSYSCTL3_BOD_BG_TRIM_EN;

      *VDDS_BOD_LEVEL = 1 means that boost mode is selected
        * -Max out the VDDS_BOD trim( = VDDS_BOD_POS_31)
        * /HWREGH(ADI3_BASE + ADI_O_MASK8B + (ADI_3_REFSYS_O_REFSYSCTL1 * 2)) =
        (ADI_3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_M << 8) |
        (ADI_3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_31);
      HWREGB(ADI3_BASE + ADI_O_SET + ADI_3_REFSYS_O_REFSYSCTL3) =
        ADI_3_REFSYS_REFSYSCTL3_BOD_BG_TRIM_EN;

      rom_setup_stepvaddrtrimto((HWREG(FCFG1_BASE + FCFG1_O_VOLT_TRIM) &
                           FCFG1_VOLT_TRIM_VDDR_TRIM_HH_M) >>
                          FCFG1_VOLT_TRIM_VDDR_TRIM_HH_S);
    }

  /* 1. Do not allow DCDC to be enabled if in external regulator mode.
   * Preventing this by setting both the RECHARGE and the ACTIVE bits bit in
   * the CCFG_MODE_CONF copy register (ccfg_ModeConfReg). 2. Adjusted battery
   * monitor low limit in internal regulator mode. This is done by setting
   * AON_BATMON_FLASHPUMPP0_LOWLIM=0 in internal regulator mode. */

  if (HWREG(AON_PMCTL_BASE + AON_PMCTL_O_PWRCTL) &
      AON_PMCTL_PWRCTL_EXT_REG_MODE)
    {
      ccfg_ModeConfReg |=
        (CCFG_MODE_CONF_DCDC_RECHARGE_M | CCFG_MODE_CONF_DCDC_ACTIVE_M);
    }
  else
    {
      HWREGBITW(AON_BATMON_BASE + AON_BATMON_O_FLASHPUMPP0,
                AON_BATMON_FLASHPUMPP0_LOWLIM_BITN) = 0;
    }

  /* set the RECHARGE source based upon CCFG:MODE_CONF:DCDC_RECHARGE Note:
   * Inverse polarity */

  HWREGBITW(AON_PMCTL_BASE + AON_PMCTL_O_PWRCTL,
            AON_PMCTL_PWRCTL_DCDC_EN_BITN) =
    (((ccfg_ModeConfReg >> CCFG_MODE_CONF_DCDC_RECHARGE_S) & 1) ^ 1);

  /* set the ACTIVE source based upon CCFG:MODE_CONF:DCDC_ACTIVE Note: Inverse
   * polarity */

  HWREGBITW(AON_PMCTL_BASE + AON_PMCTL_O_PWRCTL,
            AON_PMCTL_PWRCTL_DCDC_ACTIVE_BITN) =
    (((ccfg_ModeConfReg >> CCFG_MODE_CONF_DCDC_ACTIVE_S) & 1) ^ 1);
}

/******************************************************************************
 *
 * rom_setup_coldreset_from_shutdown_cfg2
 *
 ******************************************************************************
 */

void rom_setup_coldreset_from_shutdown_cfg2(uint32_t ui32Fcfg1Revision,
                                               uint32_t ccfg_ModeConfReg)
{
  uint32_t ui32Trim;

  /* Following sequence is required for using XOSCHF, if not included devices
   * crashes when trying to switch to XOSCHF. Trim CAP settings. Get and set
   * trim value for the ANABYPASS_VALUE1 register */

  ui32Trim = rom_setup_get_trim_anabypass_value1(ccfg_ModeConfReg);
  rom_ddi_write32(AUX_DDI0_OSC_BASE, DDI_0_OSC_O_ANABYPASSVAL1, ui32Trim);

  /* Trim RCOSC_LF. Get and set trim values for the RCOSCLF_RTUNE_TRIM and
   * RCOSCLF_CTUNE_TRIM fields in the XOSCLF_RCOSCLF_CTRL register. */

  ui32Trim = rom_setup_get_trim_rcosc_lfrtunectuntrim();
  rom_ddi_bitfield_write16(AUX_DDI0_OSC_BASE, DDI_0_OSC_O_LFOSCCTL,
                     (DDI_0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_M |
                      DDI_0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_M),
                     DDI_0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_S, ui32Trim);

  /* Trim XOSCHF IBIAS THERM. Get and set trim value for the XOSCHF IBIAS THERM 
   * bit field in the ANABYPASS_VALUE2 register. Other register bit fields are
   * set to 0. */

  ui32Trim = rom_setup_get_trim_xosc_hfibiastherm();
  rom_ddi_write32(AUX_DDI0_OSC_BASE, DDI_0_OSC_O_ANABYPASSVAL2,
                ui32Trim << DDI_0_OSC_ANABYPASSVAL2_XOSC_HF_IBIASTHERM_S);

  /* Trim AMPCOMP settings required before switch to XOSCHF */

  ui32Trim = rom_setup_get_trim_ampcompth2();
  rom_ddi_write32(AUX_DDI0_OSC_BASE, DDI_0_OSC_O_AMPCOMPTH2, ui32Trim);
  ui32Trim = rom_setup_get_trim_ampcompth1();
  rom_ddi_write32(AUX_DDI0_OSC_BASE, DDI_0_OSC_O_AMPCOMPTH1, ui32Trim);
#if ( CCFG_BASE == CCFG_BASE_DEFAULT )
  ui32Trim = rom_setup_get_trim_ampcompctrl(ui32Fcfg1Revision);
#else
  ui32Trim = NOROM_rom_setup_get_trim_ampcompctrl(ui32Fcfg1Revision);
#endif
  rom_ddi_write32(AUX_DDI0_OSC_BASE, DDI_0_OSC_O_AMPCOMPCTL, ui32Trim);

  /* Set trim for DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_MODE_EN in accordance
   * to FCFG1 setting This is bit[5] in the DDI_0_OSC_O_ADCDOUBLERNANOAMPCTL
   * register Using MASK4 write + 1 => writing to bits[7:4] */

  ui32Trim = rom_setup_get_trim_adcshmodeen(ui32Fcfg1Revision);
  HWREGB(AUX_DDI0_OSC_BASE + DDI_O_MASK4B +
         (DDI_0_OSC_O_ADCDOUBLERNANOAMPCTL * 2) + 1) = (0x20 | (ui32Trim << 1));

  /* Set trim for DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_VBUF_EN in accordance
   * to FCFG1 setting This is bit[4] in the DDI_0_OSC_O_ADCDOUBLERNANOAMPCTL
   * register Using MASK4 write + 1 => writing to bits[7:4] */

  ui32Trim = rom_setup_get_trim_adcshvbufen(ui32Fcfg1Revision);
  HWREGB(AUX_DDI0_OSC_BASE + DDI_O_MASK4B +
         (DDI_0_OSC_O_ADCDOUBLERNANOAMPCTL * 2) + 1) = (0x10 | (ui32Trim));

  /* Set trim for the PEAK_DET_ITRIM, HP_BUF_ITRIM and LP_BUF_ITRIM bit fields
   * in the DDI0_OSC_O_XOSCHFCTL register in accordance to FCFG1 setting.
   * Remaining register bit fields are set to their reset values of 0. */

  ui32Trim = rom_setup_get_trim_xosc_hfctrl(ui32Fcfg1Revision);
  rom_ddi_write32(AUX_DDI0_OSC_BASE, DDI_0_OSC_O_XOSCHFCTL, ui32Trim);

  /* Set trim for DBLR_LOOP_FILTER_RESET_VOLTAGE in accordance to FCFG1 setting
   * (This is bits [18:17] in DDI_0_OSC_O_ADCDOUBLERNANOAMPCTL) (Using MASK4
   * write + 4 => writing to bits[19:16] => (4*4)) (Assuming:
   * DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_RESET_VOLTAGE_S = 17 and
   * that DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_RESET_VOLTAGE_M =
   * 0x00060000) */

