mlyszczek/nuttx/arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_rom.c
  ui32Trim = rom_setup_get_trim_dblrloopfilter_resetvoltage(ui32Fcfg1Revision);
  HWREGB(AUX_DDI0_OSC_BASE + DDI_O_MASK4B +
         (DDI_0_OSC_O_ADCDOUBLERNANOAMPCTL * 2) + 4) = (0x60 | (ui32Trim << 1));

  /* Update DDI_0_OSC_ATESTCTL_ATESTLF_RCOSCLF_IBIAS_TRIM with data from
   * FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM This is DDI_0_OSC_O_ATESTCTL
   * bit[7] ( DDI_0_OSC_O_ATESTCTL is currently hidden (but=0x00000020)) Using
   * MASK4 write + 1 => writing to bits[7:4] */

  ui32Trim = rom_setup_get_trim_rcosc_lfibiastrim(ui32Fcfg1Revision);
  HWREGB(AUX_DDI0_OSC_BASE + DDI_O_MASK4B + (0x00000020 * 2) + 1) =
    (0x80 | (ui32Trim << 3));

  /* Update DDI_0_OSC_LFOSCCTL_XOSCLF_REGULATOR_TRIM and
   * DDI_0_OSC_LFOSCCTL_XOSCLF_CMIRRWR_RATIO in one write This can be
   * simplified since the registers are packed together in the same order both
   * in FCFG1 and in the HW register. This spans DDI_0_OSC_O_LFOSCCTL
   * bits[23:18] Using MASK8 write + 4 => writing to bits[23:16] */

  ui32Trim = rom_setup_get_trim_lfregulator_cmirrwr_ratio(ui32Fcfg1Revision);
  HWREGH(AUX_DDI0_OSC_BASE + DDI_O_MASK8B + (DDI_0_OSC_O_LFOSCCTL * 2) + 4) =
    (0xfc00 | (ui32Trim << 2));

  /* Set trim the HPM_IBIAS_WAIT_CNT, LPM_IBIAS_WAIT_CNT and IDAC_STEP bit
   * fields in the DDI0_OSC_O_RADCEXTCFG register in accordance to FCFG1
   * setting. Remaining register bit fields are set to their reset values of 0. */

  ui32Trim = rom_setup_get_trim_radc_extcfg(ui32Fcfg1Revision);
  rom_ddi_write32(AUX_DDI0_OSC_BASE, DDI_0_OSC_O_RADCEXTCFG, ui32Trim);

}

/******************************************************************************
 *
 * rom_setup_coldreset_from_shutdown_cfg3
 *
 ******************************************************************************
 */

void rom_setup_coldreset_from_shutdown_cfg3(uint32_t ccfg_ModeConfReg)
{
  uint32_t fcfg1OscConf;
  uint32_t ui32Trim;
  uint32_t currentHfClock;
  uint32_t ccfgExtLfClk;

  /* Examine the XOSC_FREQ field to select 0x1=HPOSC, 0x2=48MHz XOSC, 0x3=24MHz 
   * XOSC */

  switch ((ccfg_ModeConfReg & CCFG_MODE_CONF_XOSC_FREQ_M) >>
          CCFG_MODE_CONF_XOSC_FREQ_S)
    {
    case 2:
      /* XOSC source is a 48 MHz crystal Do nothing (since this is the reset
       * setting) */

      break;
    case 1:
      /* XOSC source is HPOSC (trim the HPOSC if this is a chip with HPOSC,
       * otherwise skip trimming and default to 24 MHz XOSC) */

      fcfg1OscConf = HWREG(FCFG1_BASE + FCFG1_O_OSC_CONF);

      if ((fcfg1OscConf & FCFG1_OSC_CONF_HPOSC_OPTION) == 0)
        {
          /* This is a HPOSC chip, apply HPOSC settings Set bit
           * DDI_0_OSC_CTL0_HPOSC_MODE_EN (this is bit 14 in DDI_0_OSC_O_CTL0) */

          HWREG(AUX_DDI0_OSC_BASE + DDI_O_SET + DDI_0_OSC_O_CTL0) =
            DDI_0_OSC_CTL0_HPOSC_MODE_EN;

          /* ADI_2_REFSYS_HPOSCCTL2_BIAS_HOLD_MODE_EN =
           * FCFG1_OSC_CONF_HPOSC_BIAS_HOLD_MODE_EN (1 bit)
           * ADI_2_REFSYS_HPOSCCTL2_CURRMIRR_RATIO =
           * FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO (4 bits)
           * ADI_2_REFSYS_HPOSCCTL1_BIAS_RES_SET =
           * FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET (4 bits)
           * ADI_2_REFSYS_HPOSCCTL0_FILTER_EN = FCFG1_OSC_CONF_HPOSC_FILTER_EN
           * (1 bit) ADI_2_REFSYS_HPOSCCTL0_BIAS_RECHARGE_DLY =
           * FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY (2 bits)
           * ADI_2_REFSYS_HPOSCCTL0_SERIES_CAP =
           * FCFG1_OSC_CONF_HPOSC_SERIES_CAP (2 bits)
           * ADI_2_REFSYS_HPOSCCTL0_DIV3_BYPASS =
           * FCFG1_OSC_CONF_HPOSC_DIV3_BYPASS (1 bit) */

          HWREG(ADI2_BASE + ADI_2_REFSYS_O_HPOSCCTL2) =
            ((HWREG(ADI2_BASE + ADI_2_REFSYS_O_HPOSCCTL2) &
              ~(ADI_2_REFSYS_HPOSCCTL2_BIAS_HOLD_MODE_EN_M |
                ADI_2_REFSYS_HPOSCCTL2_CURRMIRR_RATIO_M)) | (((fcfg1OscConf &
                                                               FCFG1_OSC_CONF_HPOSC_BIAS_HOLD_MODE_EN_M)
                                                              >>
                                                              FCFG1_OSC_CONF_HPOSC_BIAS_HOLD_MODE_EN_S)
                                                             <<
                                                             ADI_2_REFSYS_HPOSCCTL2_BIAS_HOLD_MODE_EN_S)
             |
             (((fcfg1OscConf & FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_M) >>
               FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_S) <<
              ADI_2_REFSYS_HPOSCCTL2_CURRMIRR_RATIO_S));
          HWREG(ADI2_BASE + ADI_2_REFSYS_O_HPOSCCTL1) =
            ((HWREG(ADI2_BASE + ADI_2_REFSYS_O_HPOSCCTL1) &
              ~(ADI_2_REFSYS_HPOSCCTL1_BIAS_RES_SET_M)) |
             (((fcfg1OscConf & FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_M) >>
               FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_S) <<
              ADI_2_REFSYS_HPOSCCTL1_BIAS_RES_SET_S));
          HWREG(ADI2_BASE + ADI_2_REFSYS_O_HPOSCCTL0) =
            ((HWREG(ADI2_BASE + ADI_2_REFSYS_O_HPOSCCTL0) &
              ~(ADI_2_REFSYS_HPOSCCTL0_FILTER_EN_M |
                ADI_2_REFSYS_HPOSCCTL0_BIAS_RECHARGE_DLY_M |
                ADI_2_REFSYS_HPOSCCTL0_SERIES_CAP_M |
                ADI_2_REFSYS_HPOSCCTL0_DIV3_BYPASS_M)) | (((fcfg1OscConf &
                                                            FCFG1_OSC_CONF_HPOSC_FILTER_EN_M)
                                                           >>
                                                           FCFG1_OSC_CONF_HPOSC_FILTER_EN_S)
                                                          <<
                                                          ADI_2_REFSYS_HPOSCCTL0_FILTER_EN_S)
             |
             (((fcfg1OscConf & FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_M) >>
               FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_S) <<
              ADI_2_REFSYS_HPOSCCTL0_BIAS_RECHARGE_DLY_S) |
             (((fcfg1OscConf & FCFG1_OSC_CONF_HPOSC_SERIES_CAP_M) >>
               FCFG1_OSC_CONF_HPOSC_SERIES_CAP_S) <<
              ADI_2_REFSYS_HPOSCCTL0_SERIES_CAP_S) |
             (((fcfg1OscConf & FCFG1_OSC_CONF_HPOSC_DIV3_BYPASS_M) >>
               FCFG1_OSC_CONF_HPOSC_DIV3_BYPASS_S) <<
              ADI_2_REFSYS_HPOSCCTL0_DIV3_BYPASS_S));
          break;
        }
      /* Not a HPOSC chip - fall through to default */

    default:
      /* XOSC source is a 24 MHz crystal (default) Set bit
       * DDI_0_OSC_CTL0_XTAL_IS_24M (this is bit 31 in DDI_0_OSC_O_CTL0) */

      HWREG(AUX_DDI0_OSC_BASE + DDI_O_SET + DDI_0_OSC_O_CTL0) =
        DDI_0_OSC_CTL0_XTAL_IS_24M;
      break;
    }

  /* Set XOSC_HF in bypass mode if CCFG is configured for external TCXO Please
   * note that it is up to the customer to make sure that the external clock
   * source is up and running before XOSC_HF can be used. */

  if ((HWREG(CCFG_BASE + CCFG_O_SIZE_AND_DIS_FLAGS) &
       CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO) == 0)
    {
      HWREG(AUX_DDI0_OSC_BASE + DDI_O_SET + DDI_0_OSC_O_XOSCHFCTL) =
        DDI_0_OSC_XOSCHFCTL_BYPASS;
    }

  /* Clear DDI_0_OSC_CTL0_CLK_LOSS_EN (ClockLossEventEnable()). This is bit 9
   * in DDI_0_OSC_O_CTL0. This is typically already 0 except on Lizard where it 
   * is set in ROM-boot */

