mlyszczek/nuttx/arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_rom.c
  HWREG(AUX_DDI0_OSC_BASE + DDI_O_CLR + DDI_0_OSC_O_CTL0) =
    DDI_0_OSC_CTL0_CLK_LOSS_EN;

  /* Setting DDI_0_OSC_CTL1_XOSC_HF_FAST_START according to value found in
   * FCFG1 */

  ui32Trim = rom_setup_get_trim_xosc_hffaststart();
  HWREGB(AUX_DDI0_OSC_BASE + DDI_O_MASK4B + (DDI_0_OSC_O_CTL1 * 2)) =
    (0x30 | ui32Trim);

  /* setup the LF clock based upon CCFG:MODE_CONF:SCLK_LF_OPTION */

  switch ((ccfg_ModeConfReg & CCFG_MODE_CONF_SCLK_LF_OPTION_M) >>
          CCFG_MODE_CONF_SCLK_LF_OPTION_S)
    {
    case 0:                    /* XOSC_HF_DLF (XOSCHF/1536) -> SCLK_LF (=31250 
                                 * Hz) */

      rom_osc_set_clocksource(OSC_SRC_CLK_LF, OSC_XOSC_HF);
      rom_setup_aonrtc_subsecinc(0x8637bd);        /* RTC_INCREMENT = 2^38 /
                                                 * frequency */

      break;
    case 1:                    /* EXTERNAL signal -> SCLK_LF
                                 * (frequency=2^38/CCFG_EXT_LF_CLK_RTC_INCREMENT)
                                 * * Set SCLK_LF to use the same source as SCLK_HF
                                 * * Can be simplified a bit since possible return
                                 * values for HF matches LF settings */

      currentHfClock = rom_osc_get_clocksource(OSC_SRC_CLK_HF);
      rom_osc_set_clocksource(OSC_SRC_CLK_LF, currentHfClock);
      while (rom_osc_get_clocksource(OSC_SRC_CLK_LF) != currentHfClock)
        {
          /* Wait until switched */

        }
      ccfgExtLfClk = HWREG(CCFG_BASE + CCFG_O_EXT_LF_CLK);
      rom_setup_aonrtc_subsecinc((ccfgExtLfClk & CCFG_EXT_LF_CLK_RTC_INCREMENT_M)
                              >> CCFG_EXT_LF_CLK_RTC_INCREMENT_S);
      rom_iocport_set_configuration((ccfgExtLfClk & CCFG_EXT_LF_CLK_DIO_M) >> CCFG_EXT_LF_CLK_DIO_S, IOC_PORT_AON_CLK32K, IOC_STD_INPUT | IOC_HYST_ENABLE);       /* Route 
                                                                                                                                                         * external 
                                                                                                                                                         * clock 
                                                                                                                                                         * to 
                                                                                                                                                         * AON 
                                                                                                                                                         * IOC 
                                                                                                                                                         * w/hysteresis
                                                                                                                                                         * Set XOSC_LF
                                                                                                                                                         * in bypass
                                                                                                                                                         * mode to allow 
                                                                                                                                                         * external 32
                                                                                                                                                         * kHz clock */

      HWREG(AUX_DDI0_OSC_BASE + DDI_O_SET + DDI_0_OSC_O_CTL0) =
        DDI_0_OSC_CTL0_XOSC_LF_DIG_BYPASS;
      /* Fall through to set XOSC_LF as SCLK_LF source */

    case 2:                    /* XOSC_LF -> SLCK_LF (32768 Hz) */

      rom_osc_set_clocksource(OSC_SRC_CLK_LF, OSC_XOSC_LF);
      break;
    default:                   /* (=3) RCOSC_LF */

      rom_osc_set_clocksource(OSC_SRC_CLK_LF, OSC_RCOSC_LF);
      break;
    }

  /* Update ADI_4_AUX_ADCREF1_VTRIM with value from FCFG1 */

  HWREGB(AUX_ADI4_BASE + ADI_4_AUX_O_ADCREF1) =
    (((HWREG(FCFG1_BASE + FCFG1_O_SOC_ADC_REF_TRIM_AND_OFFSET_EXT) >>
       FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_S)
      << ADI_4_AUX_ADCREF1_VTRIM_S) & ADI_4_AUX_ADCREF1_VTRIM_M);

  /* Sync with AON */

  SysCtrlAonSync();
}

/******************************************************************************
 *
 * rom_setup_get_trim_anabypass_value1
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_anabypass_value1(uint32_t ccfg_ModeConfReg)
{
  uint32_t ui32Fcfg1Value;
  uint32_t ui32XoscHfRow;
  uint32_t ui32XoscHfCol;
  uint32_t ui32TrimValue;

  /* Use device specific trim values located in factory configuration area for
   * the XOSC_HF_COLUMN_Q12 and XOSC_HF_ROW_Q12 bit fields in the
   * ANABYPASS_VALUE1 register. Value for the other bit fields are set to 0. */

  ui32Fcfg1Value = HWREG(FCFG1_BASE + FCFG1_O_CONFIG_OSC_TOP);
  ui32XoscHfRow = ((ui32Fcfg1Value &
                    FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_M) >>
                   FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_S);
  ui32XoscHfCol = ((ui32Fcfg1Value &
                    FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_M) >>
                   FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_S);

  if ((ccfg_ModeConfReg & CCFG_MODE_CONF_XOSC_CAP_MOD) == 0)
    {
      /* XOSC_CAP_MOD = 0 means: CAP_ARRAY_DELTA is in use -> Apply
       * compensation XOSC_CAPARRAY_DELTA is located in bit[15:8] of
       * ccfg_ModeConfReg Note: HW_REV_DEPENDENT_IMPLEMENTATION. Field width is 
       * not given by a define and sign extension must therefore be hard coded.
       * ( A small test program is created verifying the code lines below: Ref.: 
       * ..\test\small_standalone_test_programs\CapArrayDeltaAdjust_test.c) */

      int32_t i32CustomerDeltaAdjust =
        (((int32_t)
          (ccfg_ModeConfReg <<
           (32 - CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_W -
            CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_S))) >> (32 -
                                                        CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_W));

      while (i32CustomerDeltaAdjust < 0)
        {
          ui32XoscHfCol >>= 1;  /* COL 1 step down */

          if (ui32XoscHfCol == 0)
            {                   /* if COL below minimum */

              ui32XoscHfCol = 0xffff;   /* Set COL to maximum */

              ui32XoscHfRow >>= 1;      /* ROW 1 step down */

