mlyszczek/nuttx/arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_rom.c
              if (ui32XoscHfRow == 0)
                {               /* if ROW below minimum */

                  ui32XoscHfRow = 1;    /* Set both ROW and COL */

                  ui32XoscHfCol = 1;    /* to minimum */

                }
            }
          i32CustomerDeltaAdjust++;
        }
      while (i32CustomerDeltaAdjust > 0)
        {
          ui32XoscHfCol = (ui32XoscHfCol << 1) | 1;     /* COL 1 step up */

          if (ui32XoscHfCol > 0xffff)
            {                   /* if COL above maximum */

              ui32XoscHfCol = 1;        /* Set COL to minimum */

              ui32XoscHfRow = (ui32XoscHfRow << 1) | 1; /* ROW 1 step up */

              if (ui32XoscHfRow > 0xf)
                {               /* if ROW above maximum */

                  ui32XoscHfRow = 0xf;  /* Set both ROW and COL */

                  ui32XoscHfCol = 0xffff;       /* to maximum */

                }
            }
          i32CustomerDeltaAdjust--;
        }
    }

  ui32TrimValue =
    ((ui32XoscHfRow << DDI_0_OSC_ANABYPASSVAL1_XOSC_HF_ROW_Q12_S) |
     (ui32XoscHfCol << DDI_0_OSC_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_S));

  return (ui32TrimValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_rcosc_lfrtunectuntrim
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_rcosc_lfrtunectuntrim(void)
{
  uint32_t ui32TrimValue;

  /* Use device specific trim values located in factory configuration area */

  ui32TrimValue =
    ((HWREG(FCFG1_BASE + FCFG1_O_CONFIG_OSC_TOP) &
      FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_M) >>
     FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_S) <<
    DDI_0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_S;

  ui32TrimValue |=
    ((HWREG(FCFG1_BASE + FCFG1_O_CONFIG_OSC_TOP) &
      FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_M) >>
     FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_S) <<
    DDI_0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_S;

  return (ui32TrimValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_xosc_hfibiastherm
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_xosc_hfibiastherm(void)
{
  uint32_t ui32TrimValue;

  /* Use device specific trim value located in factory configuration area */

  ui32TrimValue =
    (HWREG(FCFG1_BASE + FCFG1_O_ANABYPASS_VALUE2) &
     FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_M) >>
    FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_S;

  return (ui32TrimValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_ampcompth2
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_ampcompth2(void)
{
  uint32_t ui32TrimValue;
  uint32_t ui32Fcfg1Value;

  /* Use device specific trim value located in factory configuration area. All
   * defined register bit fields have corresponding trim value in the factory
   * configuration area */

  ui32Fcfg1Value = HWREG(FCFG1_BASE + FCFG1_O_AMPCOMP_TH2);
  ui32TrimValue = ((ui32Fcfg1Value &
                    FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_M) >>
                   FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_S) <<
    DDI_0_OSC_AMPCOMPTH2_LPMUPDATE_LTH_S;
  ui32TrimValue |= (((ui32Fcfg1Value &
                      FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_M) >>
                     FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_S) <<
                    DDI_0_OSC_AMPCOMPTH2_LPMUPDATE_HTH_S);
  ui32TrimValue |= (((ui32Fcfg1Value &
                      FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_M) >>
                     FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_S) <<
                    DDI_0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_S);
  ui32TrimValue |= (((ui32Fcfg1Value &
                      FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_M) >>
                     FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_S) <<
                    DDI_0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_S);

  return (ui32TrimValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_ampcompth1
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_ampcompth1(void)
{
  uint32_t ui32TrimValue;
  uint32_t ui32Fcfg1Value;

  /* Use device specific trim values located in factory configuration area. All 
   * defined register bit fields have a corresponding trim value in the factory 
   * configuration area */

  ui32Fcfg1Value = HWREG(FCFG1_BASE + FCFG1_O_AMPCOMP_TH1);
  ui32TrimValue = (((ui32Fcfg1Value &
                     FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_M) >>
                    FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_S) <<
                   DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_LTH_S);
  ui32TrimValue |= (((ui32Fcfg1Value &
                      FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_M) >>
                     FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_S) <<
                    DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_HTH_S);
  ui32TrimValue |= (((ui32Fcfg1Value &
                      FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_M) >>
                     FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_S) <<
                    DDI_0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_S);
  ui32TrimValue |= (((ui32Fcfg1Value &
                      FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_M) >>
                     FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_S) <<
                    DDI_0_OSC_AMPCOMPTH1_HPMRAMP1_TH_S);

  return (ui32TrimValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_ampcompctrl
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_ampcompctrl(uint32_t ui32Fcfg1Revision)
{
  uint32_t ui32TrimValue;
  uint32_t ui32Fcfg1Value;
  uint32_t ibiasOffset;
  uint32_t ibiasInit;
  uint32_t modeConf1;
  int32_t deltaAdjust;

  /* Use device specific trim values located in factory configuration area.
   * Register bit fields without trim values in the factory configuration area
   * will be set to the value of 0. */

  ui32Fcfg1Value = HWREG(FCFG1_BASE + FCFG1_O_AMPCOMP_CTRL1);

  ibiasOffset = (ui32Fcfg1Value &
                 FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_M) >>
    FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_S;
  ibiasInit = (ui32Fcfg1Value &
               FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_M) >>
    FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_S;

  if ((HWREG(CCFG_BASE + CCFG_O_SIZE_AND_DIS_FLAGS) &
       CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_M) == 0)
    {
      /* Adjust with DELTA_IBIAS_OFFSET and DELTA_IBIAS_INIT from CCFG */

      modeConf1 = HWREG(CCFG_BASE + CCFG_O_MODE_CONF_1);

