mlyszczek/nuttx/arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_rom.c
      /* Both fields are signed 4-bit values. This is an assumption when doing
       * the sign extension. */

      deltaAdjust =
        (((int32_t)
          (modeConf1 <<
           (32 - CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_W -
            CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_S))) >> (32 -
                                                         CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_W));
      deltaAdjust += (int32_t) ibiasOffset;
      if (deltaAdjust < 0)
        {
          deltaAdjust = 0;
        }
      if (deltaAdjust >
          (DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_M >>
           DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S))
        {
          deltaAdjust =
            (DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_M >>
             DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S);
        }
      ibiasOffset = (uint32_t) deltaAdjust;

      deltaAdjust =
        (((int32_t)
          (modeConf1 <<
           (32 - CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_W -
            CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_S))) >> (32 -
                                                       CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_W));
      deltaAdjust += (int32_t) ibiasInit;
      if (deltaAdjust < 0)
        {
          deltaAdjust = 0;
        }
      if (deltaAdjust >
          (DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_M >>
           DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S))
        {
          deltaAdjust =
            (DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_M >>
             DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S);
        }
      ibiasInit = (uint32_t) deltaAdjust;
    }
  ui32TrimValue = (ibiasOffset << DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S) |
    (ibiasInit << DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S);

  ui32TrimValue |= (((ui32Fcfg1Value &
                      FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_M) >>
                     FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_S) <<
                    DDI_0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_S);
  ui32TrimValue |= (((ui32Fcfg1Value &
                      FCFG1_AMPCOMP_CTRL1_CAP_STEP_M) >>
                     FCFG1_AMPCOMP_CTRL1_CAP_STEP_S) <<
                    DDI_0_OSC_AMPCOMPCTL_CAP_STEP_S);
  ui32TrimValue |= (((ui32Fcfg1Value &
                      FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_M) >>
                     FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_S) <<
                    DDI_0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_S);

  if (ui32Fcfg1Revision >= 0x00000022)
    {
      ui32TrimValue |= (((ui32Fcfg1Value &
                          FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_M) >>
                         FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_S) <<
                        DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE_S);
    }

  return (ui32TrimValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_dblrloopfilter_resetvoltage
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_dblrloopfilter_resetvoltage(uint32_t ui32Fcfg1Revision)
{
  uint32_t dblrLoopFilterResetVoltageValue = 0; /* Reset value */

  if (ui32Fcfg1Revision >= 0x00000020)
    {
      dblrLoopFilterResetVoltageValue =
        (HWREG(FCFG1_BASE + FCFG1_O_MISC_OTP_DATA_1) &
         FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_M) >>
        FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_S;
    }

  return (dblrLoopFilterResetVoltageValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_adcshmodeen
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_adcshmodeen(uint32_t ui32Fcfg1Revision)
{
  uint32_t getTrimForAdcShModeEnValue = 1;      /* Recommended default setting */

  if (ui32Fcfg1Revision >= 0x00000022)
    {
      getTrimForAdcShModeEnValue = (HWREG(FCFG1_BASE + FCFG1_O_OSC_CONF) &
                                    FCFG1_OSC_CONF_ADC_SH_MODE_EN_M) >>
        FCFG1_OSC_CONF_ADC_SH_MODE_EN_S;
    }

  return (getTrimForAdcShModeEnValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_adcshvbufen
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_adcshvbufen(uint32_t ui32Fcfg1Revision)
{
  uint32_t getTrimForAdcShVbufEnValue = 1;      /* Recommended default setting */

  if (ui32Fcfg1Revision >= 0x00000022)
    {
      getTrimForAdcShVbufEnValue = (HWREG(FCFG1_BASE + FCFG1_O_OSC_CONF) &
                                    FCFG1_OSC_CONF_ADC_SH_VBUF_EN_M) >>
        FCFG1_OSC_CONF_ADC_SH_VBUF_EN_S;
    }

  return (getTrimForAdcShVbufEnValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_xosc_hfctrl
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_xosc_hfctrl(uint32_t ui32Fcfg1Revision)
{
  uint32_t getTrimForXoschfCtlValue = 0;        /* Recommended default setting */

  uint32_t fcfg1Data;

  if (ui32Fcfg1Revision >= 0x00000020)
    {
      fcfg1Data = HWREG(FCFG1_BASE + FCFG1_O_MISC_OTP_DATA_1);
      getTrimForXoschfCtlValue =
        (((fcfg1Data & FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_M) >>
          FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_S) <<
         DDI_0_OSC_XOSCHFCTL_PEAK_DET_ITRIM_S);

      getTrimForXoschfCtlValue |=
        (((fcfg1Data & FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_M) >>
          FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_S) <<
         DDI_0_OSC_XOSCHFCTL_HP_BUF_ITRIM_S);

      getTrimForXoschfCtlValue |=
        (((fcfg1Data & FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_M) >>
          FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_S) <<
         DDI_0_OSC_XOSCHFCTL_LP_BUF_ITRIM_S);
    }

  return (getTrimForXoschfCtlValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_xosc_hffaststart
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_xosc_hffaststart(void)
{
  uint32_t ui32XoscHfFastStartValue;

