mlyszczek/nuttx/arch/arm/src/tiva/cc13xx/cc13x2_cc26x2_rom.c
  /* Get value from FCFG1 */

  ui32XoscHfFastStartValue = (HWREG(FCFG1_BASE + FCFG1_O_OSC_CONF) &
                              FCFG1_OSC_CONF_XOSC_HF_FAST_START_M) >>
    FCFG1_OSC_CONF_XOSC_HF_FAST_START_S;

  return (ui32XoscHfFastStartValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_radc_extcfg
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_radc_extcfg(uint32_t ui32Fcfg1Revision)
{
  uint32_t getTrimForRadcExtCfgValue = 0x403f8000;      /* Recommended default
                                                         * setting */

  uint32_t fcfg1Data;

  if (ui32Fcfg1Revision >= 0x00000020)
    {
      fcfg1Data = HWREG(FCFG1_BASE + FCFG1_O_MISC_OTP_DATA_1);
      getTrimForRadcExtCfgValue =
        (((fcfg1Data & FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_M) >>
          FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_S) <<
         DDI_0_OSC_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_S);

      getTrimForRadcExtCfgValue |=
        (((fcfg1Data & FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_M) >>
          FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_S) <<
         DDI_0_OSC_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_S);

      getTrimForRadcExtCfgValue |=
        (((fcfg1Data & FCFG1_MISC_OTP_DATA_1_IDAC_STEP_M) >>
          FCFG1_MISC_OTP_DATA_1_IDAC_STEP_S) <<
         DDI_0_OSC_RADCEXTCFG_IDAC_STEP_S);
    }

  return (getTrimForRadcExtCfgValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_rcosc_lfibiastrim
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_rcosc_lfibiastrim(uint32_t ui32Fcfg1Revision)
{
  uint32_t trimForRcOscLfIBiasTrimValue = 0;    /* Default value */

  if (ui32Fcfg1Revision >= 0x00000022)
    {
      trimForRcOscLfIBiasTrimValue = (HWREG(FCFG1_BASE + FCFG1_O_OSC_CONF) &
                                      FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM_M)
        >> FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM_S;
    }

  return (trimForRcOscLfIBiasTrimValue);
}

/******************************************************************************
 *
 * rom_setup_get_trim_lfregulator_cmirrwr_ratio
 *
 ******************************************************************************
 */

uint32_t rom_setup_get_trim_lfregulator_cmirrwr_ratio(uint32_t
                                                       ui32Fcfg1Revision)
{
  uint32_t trimForXoscLfRegulatorAndCmirrwrRatioValue = 0;      /* Default
                                                                 * value for
                                                                 * both fields */

  if (ui32Fcfg1Revision >= 0x00000022)
    {
      trimForXoscLfRegulatorAndCmirrwrRatioValue =
        (HWREG(FCFG1_BASE + FCFG1_O_OSC_CONF) &
         (FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_M |
          FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_M)) >>
        FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_S;
    }

  return (trimForXoscLfRegulatorAndCmirrwrRatioValue);
}

/******************************************************************************
 *
 * rom_setup_cachemode
 *
 ******************************************************************************
 */

void rom_setup_cachemode(void)
{
  /* - Make sure to enable aggressive VIMS clock gating for power optimization
   * Only for PG2 devices. - Enable cache prefetch enable as default setting
   * (Slightly higher power consumption, but higher CPU performance) - IF (
   * CCFG_..._DIS_GPRAM == 1 ) then: Enable cache (set cache mode = 1), even if 
   * set by ROM boot code (This is done because it's not set by boot code when
   * running inside a debugger supporting the Halt In Boot (HIB)
   * functionality).  else: Set MODE_GPRAM if not already set (see inline
   * comments as well) */

  uint32_t vimsCtlMode0;

  while (HWREGBITW(VIMS_BASE + VIMS_O_STAT, VIMS_STAT_MODE_CHANGING_BITN))
    {
      /* Do nothing - wait for an eventual ongoing mode change to complete.
       * (There should typically be no wait time here, but need to be sure) */

    }

  /* Note that Mode=0 is equal to MODE_GPRAM */

  vimsCtlMode0 =
    ((HWREG(VIMS_BASE + VIMS_O_CTL) & ~VIMS_CTL_MODE_M) | VIMS_CTL_DYN_CG_EN_M |
     VIMS_CTL_PREF_EN_M);

  if (HWREG(CCFG_BASE + CCFG_O_SIZE_AND_DIS_FLAGS) &
      CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM)
    {
      /* Enable cache (and hence disable GPRAM) */

      HWREG(VIMS_BASE + VIMS_O_CTL) = (vimsCtlMode0 | VIMS_CTL_MODE_CACHE);
    }
  else if ((HWREG(VIMS_BASE + VIMS_O_STAT) & VIMS_STAT_MODE_M) !=
           VIMS_STAT_MODE_GPRAM)
    {
      /* GPRAM is enabled in CCFG but not selected Note: It is recommended to
       * go via MODE_OFF when switching to MODE_GPRAM */

      HWREG(VIMS_BASE + VIMS_O_CTL) = (vimsCtlMode0 | VIMS_CTL_MODE_OFF);
      while ((HWREG(VIMS_BASE + VIMS_O_STAT) & VIMS_STAT_MODE_M) !=
             VIMS_STAT_MODE_OFF)
        {
          /* Do nothing - wait for an eventual mode change to complete (This
           * goes fast). */

        }
      HWREG(VIMS_BASE + VIMS_O_CTL) = vimsCtlMode0;
    }
  else
    {
      /* Correct mode, but make sure PREF_EN and DYN_CG_EN always are set */

      HWREG(VIMS_BASE + VIMS_O_CTL) = vimsCtlMode0;
    }
}

/******************************************************************************
 *
 * rom_setup_aonrtc_subsecinc
 *
 ******************************************************************************
 */

void rom_setup_aonrtc_subsecinc(uint32_t subSecInc)
{
  /* Loading a new RTCSUBSECINC value is done in 5 steps: 1. Write bit[15:0] of 
   * new SUBSECINC value to AUX_SYSIF_O_RTCSUBSECINC0 2. Write bit[23:16] of
   * new SUBSECINC value to AUX_SYSIF_O_RTCSUBSECINC1 3. Set
   * AUX_SYSIF_RTCSUBSECINCCTL_UPD_REQ 4. Wait for
   * AUX_SYSIF_RTCSUBSECINCCTL_UPD_ACK 5. Clear
   * AUX_SYSIF_RTCSUBSECINCCTL_UPD_REQ */

  HWREG(AUX_SYSIF_BASE + AUX_SYSIF_O_RTCSUBSECINC0) =
    ((subSecInc) & AUX_SYSIF_RTCSUBSECINC0_INC15_0_M);
  HWREG(AUX_SYSIF_BASE + AUX_SYSIF_O_RTCSUBSECINC1) =
    ((subSecInc >> 16) & AUX_SYSIF_RTCSUBSECINC1_INC23_16_M);

  HWREG(AUX_SYSIF_BASE + AUX_SYSIF_O_RTCSUBSECINCCTL) =
    AUX_SYSIF_RTCSUBSECINCCTL_UPD_REQ;
  while (!
         (HWREGBITW
          (AUX_SYSIF_BASE + AUX_SYSIF_O_RTCSUBSECINCCTL,
           AUX_SYSIF_RTCSUBSECINCCTL_UPD_ACK_BITN)));
  HWREG(AUX_SYSIF_BASE + AUX_SYSIF_O_RTCSUBSECINCCTL) = 0;
}
